<?php

namespace Classes\Migrations\Seeders;

use Classes\Models\Topic;

class TopicsTableSeeder extends Topic {

    public function run()
    {
        $names = ["Природа", "Животные","Зоопарки", "Цветы", "Растения", "Любовь", 'Романтика', "Мужчины","Женщины", "Дети", "Молодежь", "Быт", 'Расставание', "Дипрессия","Социум", "Города", "Путешествия", "Отношения", 'Спорт', "Игры","Соревнования", "Победы", "Разочарования", "Беременность", 'Больницы', "Болезни","Аптеки", "Дружба", "Вражда", "Эмоции", 'Наказание', "Тюрьма", "Мебель", "Богатство", "Деньги", "Знаменитости"];
        foreach ($names as $name) {
            Topic::create([
                'name' => $name
            ]);
        }
        echo "Таблица Topics заполнена";
    }

}